app/controllers/train_visiting_stations_controller.rb

  def index
    @train_visiting_stations = TrainVisitingStation.all
---
SELECT `train_visiting_stations`.* FROM `train_visiting_stations`

  def edit
    @stations = Station.all
    @trains = Train.all
    @train_visiting_station = TrainVisitingStation.find(params[:id])
---
SELECT `stations`.* FROM `stations`
SELECT `trains`.* FROM `trains`
SELECT `train_visiting_stations`.* FROM `train_visiting_stations` WHERE `train_visiting_stations`.`id` = 13 LIMIT 1

  def update
    @train_visiting_station = TrainVisitingStation.find(params[:id])
    set_arrival_departure
    respond_to do |format|
      if @train_visiting_station.update_attributes(params[:train_visiting_station])
---
SELECT `train_visiting_stations`.* FROM `train_visiting_stations` WHERE `train_visiting_stations`.`id` = 13 LIMIT 1
UPDATE `train_visiting_stations` SET `arrival_time` = '2000-01-01 13:20:00', `station_id` = 16, `departure_time` = '2000-01-01 08:20:00', `updated_at` = '2016-07-25 17:07:55' WHERE `train_visiting_stations`.`id` = 13