app/controllers/travel_controller.rb

SELECT `stations`.* FROM `stations` WHERE `stations`.`id` = 16 LIMIT 1
---
  def find_trains_between_stations
  	@start_station = Station.find(params["start_station"])